<?php

namespace Database\Seeders;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Seeder;

class ContractSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $contracts = array(
            "ПОВЛАСТЕНА ПАРКИНГ КАРТА ЗА ЖИТЕЛ - ПКЖ", 
            "ПОВЛАСТЕНА ПАРКИНГ КАРТА ЗА ЖИТЕЛ - ПКЖ (второ возило)", 
            "ПОВЛАСТЕНА ПАРКИНГ КАРТА ЗА ЖИТЕЛ - ПКЖ (трето или повеќе возила)", 
            "ПОВЛАСТЕНА ПАРКИНГ КАРТА ЗА ЖИТЕЛ СО СЛУЖБЕНО ВОЗИЛО - ПКЖС", 
            "ПОВЛАСТЕНА ПАРКИНГ КАРТА ЗА ЖИТЕЛ СО СЛУЖБЕНО ВОЗИЛО - ПКЖС - второ возило", 
            "ПАРКИНГ КАРТА ЗА ЖИТЕЛ СО СЛУЖБЕНО ВОЗИЛО – ПКЖС (трето или повеќе возила)", 
            "ПАРКИНГ КАРТА ЗА ЖИТЕЛ НАДВОР ОД ОПФАТ НА ПАРКИРАЛИШТЕ", 
            "ПАРКИНГ КАРТА ЗА ЖИТЕЛ НАДВОР ОД ОПФАТ НА ПАРКИРАЛИШТЕ - второ возило", 
            "ПАРКИНГ КАРТА ЗА ЖИТЕЛ НАДВОР ОД ОПФАТ НА ПАРКИРАЛИШТЕ - трето возило", 
            "ПАРКИНГ КАРТА ЗА СОПСТВЕН ПАРКИНГ НА ЖИТЕЛ НА ОПШТИНА ЦЕНТАР – ПКСПЖ", 
            "ПАРКИНГ КАРТА ЗА СОПСТВЕН ПАРКИНГ ЗА ФИЗИЧКО ЛИЦЕ – ПКСПФ", 
            "ПАРКИНГ КАРТА ЗА СОПСТВЕН ПАРКИНГ НА ДЕЛОВЕН СУБЈЕКТ – ПКСПД", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТАНАР - ВПКС (Договор за закуп)", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТАНАР - ВПКС (Договор за закуп) - второ возило", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТАНАР - ВПКС (Договор за закуп) - трето возило", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТАНАР - ВПКС (Имотен Лист)", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТАНАР - ВПКС (Имотен Лист) - второ возило", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТАНАР - ВПКС (Имотен Лист) - трето возило", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТРАНЕЦ – ВПКСС", 
            "ВРЕМЕНСКА ПАРКИНГ КАРТА ЗА СТРАНЕЦ – ВПКСС (затворен тип)", 
            "ПАРКИНГ КАРТА ЗА ИНВАЛИДИЗИРАНИ ЛИЦА", 
            "ДЕЛОВЕН СУБЈЕКТ - СЛУЖБЕНО ВОЗИЛО - ПКДС", 
            "ВРАБОТЕН ВО ДЕЛОВЕН СУБЈЕКТ- ПКДВ", 
            "АУТОМАКЕДОНИЈА-ТЕЗГИ", 
            "ПОВЛАСТЕНА ПАРКИНГ КАРТА ЗА ДЕЛОВЕН СУБЈЕКТ ОПШТИНА ЦЕНТАР", 
            "ПАРКИНГ КАРТА ЗА ВРАБОТЕНИ ВО МНР", 
            "ППК-КАТНА ГАРАЖА", 
            "ППК-КАТНА ГАРАЖА 3,4,5 кат", 
            "ВРАБОТЕН ВО ДЕЛОВЕН СУБЈЕКТ- ПКДВ01", 
            "ДЕЛОВЕН СУБЈЕКТ - СЛУЖБЕНО ВОЗИЛО - ПКДС01", 
            "ГОСТИНСКА КАРТА ЗА ЖИТЕЛ БЕЗ СОПСТВЕНО ВОЗИЛО", 
            "ПОСЕТИТЕЛСКА КАРТА ЗА НЕГА (ПАКЕТ А)", 
            "ПОСЕТИТЕЛСКА КАРТА ЗА НЕГА (ПАКЕТ Б)", 
            "РЕЗЕРВИРАНО ПАРКИНГ МЕСТО", 
            "ПАРКИНГ КАРТА ЗА СОПСТВЕНИЦИ НА ЕЛЕКТРИЧНИ И ХИБРИДНИ ВОЗИЛА", 
            "ППК - КАТНА ГАРАЖА (24 часа) -С", 
            "ППК - КАТНА ГАРАЖА -Ф", 
            "Green Pay Card");


            foreach($contracts as  $contract){
                DB::table('contracts')->insert([
                    'contract_name' => $contract,
                ]);
            }
       


    }
}
